
// Магическая квадратная матрица
#include<iostream>

using namespace std;

int main() {

	system("chcp 1251"); // Русский язык

	int A[3][3]; // Матрица 3 на 3

	cout << "Введите 9 чисел: "; // Просим пользователя ввести число

	for (int i = 0; i < 3; i++) { // Перебираем строки матрицы

		for (int j = 0; j < 3; j++) { // Перебираем столбцы матрицы

			cin >> A[i][j]; // Вводим элемент строки i, столбца j
		}
	}



	int magic = A[0][0]; A[0][1]; A[0][2]; // значение первой строки

	int s1 = A[1][0]; A[1][1]; A[1][2]; // значение второй строки

	int s2 = A[2][0]; A[2][1]; A[2][2]; // значение третьей строки

	int s3 = A[0][0]; A[1][0]; A[2][0]; // значение первого столбца

	int s4 = A[0][1]; A[1][1]; A[2][1]; // значение второго столбца

	int s5 = A[0][2]; A[1][2]; A[2][2]; // значение третьего столбца

	int d1 = A[0][0]; A[1][1]; A[2][2]; // Главная диагональ

	int d2 = A[0][2]; A[1][1]; A[2][0]; // Побочная диагональ


	for(int i=0; i<3; i++){

		if(magic == s3 && magic == s4 && magic == s5 && magic == d1 && magic == d2 && s1 == s3 &&
		
		 s1 == s4 && s1 == s5 && s1 == d1 && s1 == d2 && s2 == s3 && s2 == s4 && s2 == s5 &&
		
		 s2 == d1 && s2 == d1 && s2 == d2){

			cout << " Магический квадрат: " << magic << s1 << s2;
		 }else{

			cout << "Не магический квадрат";
		 }
	}

	

}



